results/20260909-qwen38-dflash2-rtn-standard/bf16-clients/vllm-bench/c8.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f97dcee1080>, trust_remote_code=False, seed=42, num_prompts=48, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='qwen38', input_len=512, output_len=128, tokenizer='/model', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=3, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/profile/vllm-bench', result_filename='c8.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='25,50,75,90,99', goodput=None, request_id_prefix='bench-9c63c9be-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-09 15:20:32 [utils.py:90] Sampling input_len from [512, 512] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 3 requests...
100%|██████████| 3/3 [00:06<00:00,  2.01s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 48/48 [01:38<00:00,  2.04s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     48        
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  98.15     
Total input tokens:                      24576     
Total generated tokens:                  6144      
Request throughput (req/s):              0.49      
Output token throughput (tok/s):         62.60     
Peak output token throughput (tok/s):    21.00     
Peak concurrent requests:                9.00      
Total token throughput (tok/s):          313.00    
---------------Time to First Token----------------
Mean TTFT (ms):                          13294.30  
Median TTFT (ms):                        13695.15  
P25 TTFT (ms):                           12510.46  
P50 TTFT (ms):                           13695.15  
P75 TTFT (ms):                           15406.30  
P90 TTFT (ms):                           16610.36  
P99 TTFT (ms):                           17119.18  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.79     
Median TPOT (ms):                        10.85     
P25 TPOT (ms):                           8.14      
P50 TPOT (ms):                           10.85     
P75 TPOT (ms):                           19.69     
P90 TPOT (ms):                           23.57     
P99 TPOT (ms):                           26.87     
---------------Inter-token Latency----------------
Mean ITL (ms):                           49.10     
Median ITL (ms):                         49.10     
P25 ITL (ms):                            49.00     
P50 ITL (ms):                            49.10     
P75 ITL (ms):                            49.22     
P90 ITL (ms):                            49.47     
P99 ITL (ms):                            50.00     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          15045.61  
Median E2EL (ms):                        15401.90  
P25 E2EL (ms):                           14132.86  
P50 E2EL (ms):                           15401.90  
P75 E2EL (ms):                           17300.50  
P90 E2EL (ms):                           18179.36  
P99 E2EL (ms):                           19062.33  
---------------Speculative Decoding---------------
Acceptance rate (%):                     37.74     
Acceptance length:                       3.64      
Drafts:                                  1712      
Draft tokens:                            11984     
Accepted tokens:                         4523      
Per-position acceptance (%):
  Position 0:                            66.82     
  Position 1:                            48.07     
  Position 2:                            38.96     
  Position 3:                            30.49     
  Position 4:                            28.21     
  Position 5:                            26.52     
  Position 6:                            25.12     
==================================================